
// TODO bobo; 2018-09-21; you can do it!
// TODO genrikh; 2020-09-11; Вынести сортировку в отдельный класс !!!!!
// TODO you can do it!
// TODO digi; 2016-04-08; добавить writeLine!!!
// TODO pe; 2015-08-10; почему кодировка только utf?
// TODO PE; 2018-08-20; переименовать?
// TODO Anonymous Developer; 2016-03-17; Необходимо переписать этот код и использовать асинхронные версии функций для чтения из файла
// TODO Digi; 2018-09-21; Добавить функцию getFileName, которая по пути файла будет возвращать его имя. Воспользоваться модулем path из Node.js
// TODO Veronika; 2018-08-16; сделать кодировку настраиваемой
